# Игра камень-ножницы-бумага
#
# Необходимо написать игру "камень ножницы бумага". Как работает игра. Мы запускаем файл.
# Далее программа спрашивает нас, что мы выбираем (игрок) – камень/ножницы/бумага.
# Далее боту рандомится камень/ножницы/бумага. Затем происходит проверка кто выиграл
#
# Решить задачу необходимо используя 4 функции:
#
# 1) получение выбора игрока
# 2) получение выбора бота
# 3) расчет победителя
# 4) функция play в которой идет игра
#
# Дополнительно:
# 1) добавьте возможность сыграть не один раз, а несколько
# 2) после завершения игры сделайте вывод кол-ва побед и поражений (предусмотрите вариант ничьи)

import random
NUMBER_OF_WIN = 0

def player_move():
    pass

def bot_move():
    pass

def win():
    pass

def play():
    pass